Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
// Coordinate identity must retain all four signed 32-bit components. A packed
// uint64_t key aliases values outside an int16 domain, including ordinary
// negative sparse-grid coordinates. The hash only selects buckets; array
// equality remains the uniqueness contract.
struct SparseCoordinateHash {
    size_t operator()(const SparseCoordinate& coordinate) const noexcept {
        uint64_t hash = 1469598103934665603ULL;
        for (int32_t value : coordinate) {
            hash ^= static_cast<uint32_t>(value);
            hash *= 1099511628211ULL;
        }
        return static_cast<size_t>(hash);
    }
};

SparseCoordinate sparse_coordinate(int32_t b, int32_t x, int32_t y, int32_t z) {
    return {b, x, y, z};
}

uint64_t sparse_coordinate_seed(const SparseCoordinate& coordinate) {
    return static_cast<uint64_t>(SparseCoordinateHash{}(coordinate));
}

// Mirrors prune_sparse_structure(..., max_neighbor_axes_dist=1). The source
// occupancy is binary and coordinates are unique, so testing the 3^3
// neighbourhood directly is identical to the Python conv3d count while
// preserving torch.argwhere's input order.
std::vector<int32_t> prune_surface_coords(const std::vector<int32_t>& coords,
                                          int max_neighbor_axes_dist = 1) {
    GGML_ASSERT(coords.size() % 4 == 0);
    std::unordered_set<SparseCoordinate, SparseCoordinateHash> occupied;
    occupied.reserve(coords.size() / 2);
    for (size_t i = 0; i < coords.size(); i += 4) {
        occupied.insert(sparse_coordinate(coords[i], coords[i + 1],
                                          coords[i + 2], coords[i + 3]));
    }

    std::vector<int32_t> surface;
    surface.reserve(coords.size());
    for (size_t i = 0; i < coords.size(); i += 4) {
        const int32_t b = coords[i];
        bool is_surface = false;
        for (int dx = -max_neighbor_axes_dist;
             dx <= max_neighbor_axes_dist && !is_surface; ++dx) {
            for (int dy = -max_neighbor_axes_dist;
                 dy <= max_neighbor_axes_dist && !is_surface; ++dy) {
                for (int dz = -max_neighbor_axes_dist;
                     dz <= max_neighbor_axes_dist; ++dz) {
                    if (occupied.find(sparse_coordinate(
                                b, coords[i + 1] + dx, coords[i + 2] + dy,
                                coords[i + 3] + dz)) == occupied.end()) {
                        is_surface = true;
                        break;
                    }
                }
            }
        }
        if (is_surface)
            surface.insert(surface.end(),
                           coords.begin() + static_cast<ptrdiff_t>(i),
                           coords.begin() + static_cast<ptrdiff_t>(i + 4));
    }
    return surface;
}

}  // namespace

// Match sam3d_objects.pipeline.inference_utils.downsample_sparse_structure.
// The sparse DiT uses int32 coordinate tables, so keeping this policy in the
// C++ runtime is required for large (dense) occupancy fields.
std::vector<int32_t> downsample_sparse_coords_pytorch(
        const std::vector<int32_t>& coords,
        PytorchPhiloxNormalRng& rng,
        std::string& error,
        bool& randomly_subsampled,
        int64_t max_coords,
        int downsample_factor) {
    randomly_subsampled = false;
    const int64_t n = static_cast<int64_t>(coords.size() / 4);
    if (n <= max_coords) return coords;
    if (n == 0) return {};

    std::array<int32_t, 3> lo{coords[1], coords[2], coords[3]};
    std::array<int32_t, 3> hi = lo;
    for (int64_t i = 1; i < n; ++i) {
        for (int c = 0; c < 3; ++c) {
            const int32_t v = coords[static_cast<size_t>(i) * 4 + c + 1];
            lo[c] = std::min(lo[c], v);
            hi[c] = std::max(hi[c], v);
        }
    }
    // The Python pipeline casts to float before each arithmetic operation.
    // Preserve F32 rounding, including torch.round's tie-to-even behavior.
    std::array<float, 3> original{}, target{}, target_min{}, target_max{};
    std::array<int32_t, 3> target_min_i{}, target_max_i{};
    for (int c = 0; c < 3; ++c) {
        original[c] = static_cast<float>(hi[c] - lo[c] + 1);
        target[c] = original[c] / static_cast<float>(downsample_factor);
        const float offset = (original[c] - target[c]) * 0.5f;
        target_min[c] = static_cast<float>(lo[c]) + offset;
        target_max[c] = target_min[c] + target[c] - 1.0f;
        // torch.Tensor.int() truncates toward zero (rather than floor/ceil).
        target_min_i[c] = static_cast<int32_t>(target_min[c]);
        target_max_i[c] = static_cast<int32_t>(target_max[c]);
    }

    std::vector<int32_t> unique;
    unique.reserve(static_cast<size_t>(n));
    std::unordered_set<SparseCoordinate, SparseCoordinateHash> seen;
    seen.reserve(static_cast<size_t>(n) * 2);
    for (int64_t i = 0; i < n; ++i) {
        const int32_t* p = &coords[static_cast<size_t>(i) * 4];
        int32_t out[4] = {p[0], 0, 0, 0};
        for (int c = 0; c < 3; ++c) {
            const float denom = static_cast<float>(hi[c] - lo[c]);
            const float normalized = denom > 0.0f
                                             ? (static_cast<float>(p[c + 1]) -
                                                static_cast<float>(lo[c])) /
                                                       denom
                                             : 0.0f;
            const float value = normalized * (target[c] - 1.0f) + target_min[c];
            // torch.round uses round-to-nearest with ties to even, unlike
            // std::round and floor(x + 0.5) for negative/halfway values.
            const float floor_value = std::floor(value);
            const float fractional = value - floor_value;
            int64_t rounded = static_cast<int64_t>(floor_value);
            if (fractional > 0.5f ||
                (fractional == 0.5f && (rounded & 1LL) != 0)) {
                ++rounded;
            }
            rounded = std::max<int64_t>(rounded, target_min_i[c]);
            rounded = std::min<int64_t>(rounded, target_max_i[c]);
            out[c + 1] = static_cast<int32_t>(rounded);
        }
        const SparseCoordinate k =
                sparse_coordinate(out[0], out[1], out[2], out[3]);
        if (seen.insert(k).second) unique.insert(unique.end(), out, out + 4);
    }
    const size_t unique_n = unique.size() / 4;
    // torch.unique(..., dim=0) returns rows in lexicographic order.  Insertion
    // order is observably different when randperm selects a subset.
    std::vector<size_t> lexicographic_order(unique_n);
    std::iota(lexicographic_order.begin(), lexicographic_order.end(), 0U);
    std::sort(lexicographic_order.begin(), lexicographic_order.end(),
              [&unique](size_t left, size_t right) {
                  for (size_t component = 0; component < 4; ++component) {
                      const int32_t a = unique[left * 4 + component];
                      const int32_t b = unique[right * 4 + component];
                      if (a != b) return a < b;
                  }
                  return false;
              });
    std::vector<int32_t> sorted_unique;
    sorted_unique.reserve(unique.size());
    for (size_t index : lexicographic_order) {
        const int32_t* point = unique.data() + index * 4;
        sorted_unique.insert(sorted_unique.end(), point, point + 4);
    }
    unique.swap(sorted_unique);
    if (unique_n > static_cast<size_t>(max_coords)) {
        std::vector<uint32_t> order;
        if (!rng.randperm(unique_n, order, error)) return {};
        std::vector<int32_t> sampled;
        sampled.reserve(static_cast<size_t>(max_coords) * 4);
        for (size_t j = 0; j < static_cast<size_t>(max_coords); ++j) {
            const int32_t* p = &unique[order[j] * 4];
            sampled.insert(sampled.end(), p, p + 4);
        }
        randomly_subsampled = true;
        return sampled;
    }
    return unique;
}

namespace {

// batched DINO forwards: ONE graph per call, several (prefix, image) pairs
// sharing the same weights model - avoids the multi-alloc CUDA graph-capture
// trouble of running many small graphs on one backend.
struct DinoDbg {
    bool enabled = false;
    std::string debug_stage;
    std::string out_path;
};

std::vector<std::vector<float>> run_dino_batch(
        Stage& st,
        const std::vector<std::pair<std::string, const RawImg*>>& jobs,
        bool prenorm,
        int64_t& out_n,
        const DinoDbg* dbg = nullptr,
        bool manual_attention = false) {
    GraphContext gctx;
    struct Job {
        DinoGraph dg;
        ggml_tensor* in;
        ggml_tensor* out;
    };
    // dbg: build/run only the first DINO job and write its debug_stage
    // boundary tensor to out_path for parity bisects (mixed-size debug
    // graphs cannot share one batched allocation).
    const bool dino_dbg = dbg && dbg->enabled;
    const char* dino_dbg_out = dbg ? dbg->out_path.c_str() : nullptr;
    std::vector<Job> js;
    for (auto& [prefix, img] : jobs) {
        if (dino_dbg && !js.empty()) break;
        js.emplace_back();
        js.back().dg.g = &gctx;
        js.back().dg.m = st.model.get();
        js.back().dg.prefix = prefix;
        js.back().dg.prenorm = prenorm;
        // The condition DINO contract is the explicit F32 attention form; the
        // flash path (F16 K/V) measurably perturbs the outlier channels and
        // collapses the SS occupancy decision downstream.
        js.back().dg.manual_attention = manual_attention;
        // optional per-boundary parity dumps, same contract as the other
        // condition-chain graphs
        if (dbg && !dbg->debug_stage.empty())
            js.back().dg.debug_stage = dbg->debug_stage;
        js.back().in = gctx.input_f32("image", {img->c, img->w, img->h});
        js.back().dg.inputs.push_back(js.back().in);
        js.back().dg.table_data.push_back(nullptr);
        js.back().out = js.back().dg.build(js.back().in);
    }
    ggml_cgraph* graph = ggml_new_graph_custom(gctx.ctx(), 32768, false);
    for (auto& j : js) ggml_build_forward_expand(graph, j.out);
    record_dtype_contract_graph(
            prenorm ? "slat_condition_dino" : "ss_condition_dino", graph);
    if (!st.backend->alloc(graph)) {
        out_n = -1;
        return {};
    }
    // upload everything (images + build-internal tables)
    for (size_t k = 0; k < js.size(); k++) {
        const RawImg* img = jobs[k].second;
        if (!st.backend->set_input_f32(js[k].in, img->data.data(),
                                       (size_t)img->c * img->w * img->h)) {
            out_n = -1;
            return {};
        }
    }
    for (auto& j : js) {
        for (size_t ti = 0; ti < j.dg.inputs.size(); ti++) {
            ggml_tensor* t = j.dg.inputs[ti];
            if (!t->buffer || !j.dg.table_data[ti]) continue;
            const auto& host = j.dg.table_data[ti];
            bool ok = t->type == GGML_TYPE_F32
                              ? st.backend->set_input_f32(
                                        t, (const float*)host->data(),
                                        host->size())
                              : st.backend->set_input_i32(t, host->data(),
                                                          host->size());
            if (!ok) {
                out_n = -1;
                return {};
            }
        }
    }
    if (!st.backend->run(graph)) {
        out_n = -1;
        return {};
    }
    std::vector<std::vector<float>> outs(js.size());
    for (size_t k = 0; k < js.size(); k++)
        st.backend->get_tensor_f32(js[k].out, outs[k]);
    out_n = js[0].out->ne[1];
    if (dino_dbg && dino_dbg_out) {
        const auto& t = js[0].out;
        std::ofstream df(dino_dbg_out, std::ios::binary);
        df.write(reinterpret_cast<const char*>(outs[0].data()),
                 std::streamsize(outs[0].size() * sizeof(float)));
        df.close();
        LOGI("dino dbg: wrote %s raw f32 (ne %lldx%lld, %zu floats)",
             dino_dbg_out, (long long)t->ne[0], (long long)t->ne[1],
             outs[0].size());
    }
    return outs;
}

// batched PointPatch forwards: one graph, one run per input pair
std::vector<std::vector<float>> run_pointpatch_batch(
        Stage& st,
        const std::string& prefix,
        const std::vector<std::pair<const std::vector<float>*,
                                    std::pair<int64_t, int64_t>>>& jobs) {
    GraphContext gctx;
    struct Job {
        PointPatchGraph pp;
        ggml_tensor* in;
        ggml_tensor* out;
    };
    std::vector<Job> js;
    for (auto& [pm, wh] : jobs) {
        js.emplace_back();
        js.back().pp.g = &gctx;
        js.back().pp.m = st.model.get();
        js.back().pp.prefix = prefix;
        js.back().in = gctx.input_f32("pointmap", {wh.first, wh.second, 3});
        js.back().pp.inputs.push_back(js.back().in);
        js.back().pp.table_data.push_back(nullptr);
        js.back().out = js.back().pp.build(js.back().in);
    }
    ggml_cgraph* graph = ggml_new_graph_custom(gctx.ctx(), 32768, false);
    for (auto& j : js) ggml_build_forward_expand(graph, j.out);
    record_dtype_contract_graph("ss_condition_pointpatch", graph);
    if (!st.backend->alloc(graph)) return {};
    const int64_t n_px = jobs[0].second.first * jobs[0].second.second;
    std::vector<float> ones(n_px, 1.0f), zeros(n_px, 0.0f);
    for (size_t k = 0; k < js.size(); k++) {
        if (!st.backend->set_input_f32(js[k].in, jobs[k].first->data(),
                                       jobs[k].first->size()))
            return {};
        for (ggml_tensor* mk : js[k].pp.mask_inputs) {
            if (!mk->buffer) continue;
            const bool is_valid = !strcmp(mk->name, "pp_valid");
            if (!st.backend->set_input_f32(
                        mk, is_valid ? ones.data() : zeros.data(),
                        (size_t)ggml_nelements(mk)))
                return {};
        }
    }
    // upload the build-internal gather tables (resize indices, cls indices)
    for (auto& j : js) {
        for (size_t ti = 0; ti < j.pp.inputs.size(); ti++) {
            ggml_tensor* t = j.pp.inputs[ti];
            if (!t->buffer || !j.pp.table_data[ti]) continue;
            const auto& host = j.pp.table_data[ti];
            bool ok = t->type == GGML_TYPE_F32
                              ? st.backend->set_input_f32(
                                        t, (const float*)host->data(),
                                        host->size())
                              : st.backend->set_input_i32(t, host->data(),
                                                          host->size());
            if (!ok) return {};
        }
    }
    if (!st.backend->run(graph)) return {};
    std::vector<std::vector<float>> outs(js.size());
    for (size_t k = 0; k < js.size(); k++)
        st.backend->get_tensor_f32(js[k].out, outs[k]);
    return outs;
}

