Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
// EmbedderFuser in-graph: per segment LayerNorm -> SwiGLU -> + idx_emb, concat.
// Segments may share a projection net (same embedder, different inputs).
struct FuserSeg {
    int64_t in_ch;  // token channel count (1024 dino / 512 pointpatch)
    int64_t n;
    int embedder;  // proj prefix index (cemb.emb{E})
    int pos_idx;   // idx_emb column
    std::vector<float> host;
    ggml_tensor* tokens = nullptr;  // created inside build_fuser
};

// builds the fuser subgraph; returns the concat output and fills upload list
ggml_tensor* build_fuser(GraphContext& gctx,
                         GGUFModel& m,
                         std::vector<FuserSeg>& segs,
                         const std::string& cemb_prefix) {
    ggml_context* ctx = gctx.ctx();
    auto as_f32 = [&](ggml_tensor* t) {
        return t->type == GGML_TYPE_F32 ? t : ggml_cast(ctx, t, GGML_TYPE_F32);
    };
    auto matmul_weight = [&](ggml_tensor* t) {
        return ggml_is_quantized(t->type) ? t : as_f32(t);
    };
    ggml_tensor* idx_emb =
            as_f32(m.get(cemb_prefix + ".idx_emb"));  // ne = [C, n_groups]
    const int64_t C = idx_emb->ne[0];
    ggml_tensor* cat = nullptr;
    for (auto& s : segs) {
        const std::string p = cemb_prefix + ".emb" + std::to_string(s.embedder);
        ggml_tensor* x = gctx.input_f32("fuse_seg", {s.in_ch, s.n});
        s.tokens = x;
        ggml_tensor* h =
                gb_layer_norm(ctx, x, as_f32(m.get(p + ".proj_ln.weight")),
                              as_f32(m.get(p + ".proj_ln.bias")), 1e-5f);
        ggml_tensor* g1 = gb_linear(
                ctx, matmul_weight(m.get(p + ".proj.w1.weight")), nullptr, h);
        ggml_tensor* g3 = gb_linear(
                ctx, matmul_weight(m.get(p + ".proj.w3.weight")), nullptr, h);
        ggml_tensor* act = ggml_mul(ctx, ggml_silu(ctx, g1), g3);
        ggml_tensor* o = gb_linear(
                ctx, matmul_weight(m.get(p + ".proj.w2.weight")), nullptr, act);
        ggml_tensor* pe =
                ggml_view_1d(ctx, idx_emb, C, s.pos_idx * C * sizeof(float));
        o = ggml_add(ctx, o, pe);  // (C,1) broadcasts over (C,n)
        cat = cat ? ggml_concat(ctx, cat, o, 1) : o;
    }
    return cat;
}

// load condition inputs dumped by dump_e2e_stages.py
struct CondInputs {
    RawImg image, rgb_image, mask3, rgb_image_mask3;  // HWC (dino)
    std::vector<float> pointmap, rgb_pointmap;        // CHW (pointpatch)
    int64_t W = 518, H = 518;
};

// 1-channel masks: the Dino wrapper repeats them to 3 channels
void repeat_mask_channels_to_3(RawImg& m) {
    if (m.c != 1) return;
    std::vector<float> m3(m.data.size() * 3);
    for (size_t i = 0; i < m.data.size(); i++)
        for (int c = 0; c < 3; c++) m3[i * 3 + c] = m.data[i];
    m.c = 3;
    m.data = std::move(m3);
}

bool load_cond_inputs(const std::string& dir, CondInputs& ci) {
    auto load = [&](const char* name, RawTensor& t) {
        if (!load_raw_tensor(dir + "/" + name, t)) {
            LOGE("e2e: missing %s/%s", dir.c_str(), name);
            return false;
        }
        return true;
    };
    RawTensor image, rgb_image, mask, rgb_image_mask, pointmap, rgb_pointmap;
    if (!load("ss_input_image.samt", image)) return false;
    if (!load("ss_input_rgb_image.samt", rgb_image)) return false;
    if (!load("ss_input_mask.samt", mask)) return false;
    if (!load("ss_input_rgb_image_mask.samt", rgb_image_mask)) return false;
    if (!load("ss_input_pointmap.samt", pointmap)) return false;
    if (!load("ss_input_rgb_pointmap.samt", rgb_pointmap)) return false;

    ci.image = chw_to_hwc(image);
    ci.rgb_image = chw_to_hwc(rgb_image);
    ci.W = ci.image.w;
    ci.H = ci.image.h;
    ci.mask3 = chw_to_hwc(mask);
    ci.rgb_image_mask3 = chw_to_hwc(rgb_image_mask);
    repeat_mask_channels_to_3(ci.mask3);
    repeat_mask_channels_to_3(ci.rgb_image_mask3);
    ci.pointmap = as_chw(pointmap);
    ci.rgb_pointmap = as_chw(rgb_pointmap);
    return true;
}

// In-memory equivalent of load_cond_inputs(): the file path stores the CHW
// f32 payloads verbatim (ne = [W, H, C, 1]) and reads them back through
// chw_to_hwc/as_chw; this performs the identical index transforms on the
// native condition struct, so the full-pipeline numerics are bit-exact
// without the disk round-trip.
bool cond_inputs_from_native(const NativeConditionInputs& in, CondInputs& ci) {
    const int64_t W = in.width;
    const int64_t H = in.height;
    if (W <= 0 || H <= 0) {
        LOGE("e2e: invalid in-memory condition dimensions %lldx%lld",
             (long long)W, (long long)H);
        return false;
    }
    const size_t image_elems = static_cast<size_t>(W) * H * 3;
    const size_t mask_elems = static_cast<size_t>(W) * H;
    if (in.image.size() != image_elems || in.rgb_image.size() != image_elems ||
        in.pointmap.size() != image_elems ||
        in.rgb_pointmap.size() != image_elems || in.mask.size() != mask_elems ||
        in.rgb_image_mask.size() != mask_elems) {
        LOGE("e2e: in-memory condition payload sizes mismatch %lldx%lld",
             (long long)W, (long long)H);
        return false;
    }
    auto to_hwc = [&](const std::vector<float>& chw, int64_t C) {
        RawImg out;
        out.c = C;
        out.h = H;
        out.w = W;
        out.data.resize(static_cast<size_t>(C) * H * W);
        const float* src = chw.data();
        for (int64_t y = 0; y < H; y++)
            for (int64_t x = 0; x < W; x++)
                for (int64_t c = 0; c < C; c++)
                    out.data[(y * W + x) * C + c] = src[c * H * W + y * W + x];
        return out;
    };
    ci.image = to_hwc(in.image, 3);
    ci.rgb_image = to_hwc(in.rgb_image, 3);
    ci.W = W;
    ci.H = H;
    ci.mask3 = to_hwc(in.mask, 1);
    ci.rgb_image_mask3 = to_hwc(in.rgb_image_mask, 1);
    repeat_mask_channels_to_3(ci.mask3);
    repeat_mask_channels_to_3(ci.rgb_image_mask3);
    ci.pointmap = in.pointmap;  // CHW passthrough (bit-exact)
    ci.rgb_pointmap = in.rgb_pointmap;
    return true;
}

// Cross-backend parity sampling requires the reference PyTorch CUDA
// distribution-block count. The source runtime read it from an environment
// variable; AICore tasks must not use environment control, so the caller
// passes it through the explicit philox_blocks option instead.
bool pytorch_philox_distribution_blocks_from_environment(uint32_t& blocks,
                                                         std::string& error) {
    (void)blocks;
    error = "philox_blocks option required: CPU/Vulkan native-seed sampling "
            "needs the reference PyTorch CUDA distribution-block count; set "
            "aicore_sam3d_options_set_philox_blocks() explicitly";
    return false;
}

bool load_noise_opt(const std::string& dir,
                    const char* name,
                    std::vector<float>& v,
                    int64_t expect_elems) {
    if (dir.empty()) return false;
    RawTensor t;
    if (!load_raw_tensor(dir + "/" + name, t)) return false;
    const size_t n = t.data.size() / 4;
    if ((int64_t)n != expect_elems) {
        LOGE("noise %s: expected %lld elems, got %zu", name,
             (long long)expect_elems, n);
        return false;
    }
    v.assign((const float*)t.data.data(), (const float*)t.data.data() + n);
    return true;
}

bool load_f32_vector(const std::string& path,
                     size_t expected_elements,
                     std::array<float, 3>& output) {
    RawTensor tensor;
    if (!load_raw_tensor(path, tensor) || tensor.type != GGML_TYPE_F32 ||
        tensor.data.size() != expected_elements * sizeof(float)) {
        LOGE("e2e: expected F32[%zu] tensor %s", expected_elements,
             path.c_str());
        return false;
    }
    const float* values = reinterpret_cast<const float*>(tensor.data.data());
    for (size_t index = 0; index < expected_elements; ++index)
        output[index] = values[index];
    return true;
}

