Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
// Replaying an official SLat noise tensor by position, rather than by its
// compact token index, makes an SS-boundary change reproducible. Most target
// cells retain the exact official initial state; cells introduced by the
// backend's occupancy decision receive a stable coordinate-derived state.
bool load_slat_noise_for_coords(const std::string& dir,
                                const std::vector<int32_t>& target_coords,
                                unsigned seed,
                                std::vector<float>& target_noise) {
    if (dir.empty() || target_coords.size() % 4 != 0) return false;
    RawTensor ref_noise;
    RawTensor ref_coords;
    if (!load_raw_tensor(dir + "/slat_x0.samt", ref_noise) ||
        !load_raw_tensor(dir + "/slat_coords.samt", ref_coords) ||
        ref_noise.type != GGML_TYPE_F32 || ref_coords.type != GGML_TYPE_I32) {
        return false;
    }
    const size_t n_ref = ref_noise.data.size() / (8 * sizeof(float));
    if (n_ref == 0 || ref_noise.data.size() != n_ref * 8 * sizeof(float) ||
        ref_coords.data.size() != n_ref * 4 * sizeof(int32_t)) {
        LOGE("slat noise replay: malformed reference support");
        return false;
    }

    const int32_t* ref_coord_data =
            reinterpret_cast<const int32_t*>(ref_coords.data.data());
    const float* ref_noise_data =
            reinterpret_cast<const float*>(ref_noise.data.data());
    std::unordered_map<SparseCoordinate, size_t, SparseCoordinateHash>
            reference_index;
    reference_index.reserve(n_ref * 2);
    for (size_t i = 0; i < n_ref; ++i) {
        const int32_t* coord = ref_coord_data + 4 * i;
        reference_index.emplace(
                sparse_coordinate(coord[0], coord[1], coord[2], coord[3]), i);
    }

    const size_t n_target = target_coords.size() / 4;
    target_noise.resize(n_target * 8);
    size_t replayed = 0;
    for (size_t i = 0; i < n_target; ++i) {
        const int32_t* coord = target_coords.data() + 4 * i;
        const SparseCoordinate key =
                sparse_coordinate(coord[0], coord[1], coord[2], coord[3]);
        const auto it = reference_index.find(key);
        float* output = target_noise.data() + 8 * i;
        if (it != reference_index.end()) {
            std::memcpy(output, ref_noise_data + 8 * it->second,
                        8 * sizeof(float));
            ++replayed;
            continue;
        }
        // This branch is diagnostic only: it supplies a stable state for a
        // coordinate absent from the official replay support. It is never a
        // claim that the added coordinate exists in PyTorch. Philox removes
        // the former host-library-dependent random distribution.
        const uint64_t key_seed = sparse_coordinate_seed(key);
        const uint64_t local_seed =
                key_seed ^ (key_seed >> 32U) ^ static_cast<uint64_t>(seed);
        PytorchPhiloxNormalRng local_rng(local_seed, 1);
        std::vector<float> local_noise(8);
        std::string local_error;
        if (!local_rng.fill(local_noise, local_error)) {
            LOGE("slat noise replay: coordinate Philox fallback failed: %s",
                 local_error.c_str());
            return false;
        }
        std::memcpy(output, local_noise.data(), 8 * sizeof(float));
    }
    LOGI("slat noise replay: %zu/%zu cells matched official support", replayed,
         n_target);
    return true;
}

// --- SLat denorm constants (checkpoints/hf/pipeline.yaml) -----------------
// The inference_utils defaults describe a different checkpoint family. The
// shipped pipeline overrides both vectors, and these are therefore part of
// the model contract rather than generic runtime defaults.
constexpr float SLAT_STD[8] = {2.37326008f, 2.13174402f, 2.24139530f,
                               2.30589401f, 2.11918940f, 1.89695110f,
                               2.41684989f, 2.08374642f};
constexpr float SLAT_MEAN[8] = {0.12211431f,  0.37204156f,  -1.26521907f,
                                -2.05276058f, -3.10432536f, -0.11294304f,
                                -0.85146744f, 0.45506954f};

// Gaussian decoder representation constants (slat_decoder_gs.yaml)
constexpr int GS_NGAUSS = 32;
constexpr float GS_VOXEL_SIZE = 1.5f;
constexpr float GS_SCALING_BIAS = 0.004f;
constexpr float GS_OPACITY_BIAS = 0.1f;
constexpr float GS_MIN_KERNEL = 0.0009f;

inline float softplus(float x) { return x > 20.f ? x : logf(1.f + expf(x)); }
inline float softplus_inv(float y) {
    return y + logf(1.f - expf(-y));
}  // y > 0
inline float inv_sigmoid(float p) { return logf(p / (1.f - p)); }

// write the official 3DGS PLY (matches gaussian_model.save_ply: sh_degree 0)
bool write_gaussian_ply(const std::string& path,
                        int64_t n_gs,
                        const std::vector<float>& xyz,
                        const std::vector<float>& fdc,
                        const std::vector<float>& opacity,
                        const std::vector<float>& scaling,
                        const std::vector<float>& rotation) {
    FILE* f = fopen(path.c_str(), "wb");
    if (!f) return false;
    char head[1024];
    snprintf(head, sizeof(head),
             "ply\nformat binary_little_endian 1.0\ncomment NeoGaussian\n"
             "element vertex %lld\n"
             "property float x\nproperty float y\nproperty float z\n"
             "property float nx\nproperty float ny\nproperty float nz\n"
             "property float f_dc_0\nproperty float f_dc_1\nproperty float "
             "f_dc_2\n"
             "property float opacity\n"
             "property float scale_0\nproperty float scale_1\nproperty float "
             "scale_2\n"
             "property float rot_0\nproperty float rot_1\nproperty float "
             "rot_2\nproperty float rot_3\n"
             "end_header\n",
             (long long)n_gs);
    fwrite(head, 1, strlen(head), f);
    std::vector<float> row(3 + 3 + 3 + 1 + 3 + 4);
    const float scale_bias = softplus_inv(GS_SCALING_BIAS);
    const float op_bias = inv_sigmoid(GS_OPACITY_BIAS);
    for (int64_t i = 0; i < n_gs; i++) {
        // PLY xyz = _xyz * aabb[3:] + aabb[:3] with aabb = [-.5,-.5,-.5,1,1,1]
        row[0] = xyz[i * 3 + 0] - 0.5f;
        row[1] = xyz[i * 3 + 1] - 0.5f;
        row[2] = xyz[i * 3 + 2] - 0.5f;
        row[3] = row[4] = row[5] = 0.f;
        for (int k = 0; k < 3; k++) row[6 + k] = fdc[i * 3 + k];
        // scale = log(sqrt(softplus(s + softplus_inv(bias))^2 + min_kernel^2))
        for (int k = 0; k < 3; k++) {
            float sp = softplus(scaling[i * 3 + k] + scale_bias);
            row[10 + k] = logf(sqrtf(sp * sp + GS_MIN_KERNEL * GS_MIN_KERNEL));
        }
        // opacity = inverse_sigmoid(sigmoid(op + inverse_sigmoid(bias))) = op +
        // bias
        row[9] = opacity[i] + op_bias;
        // rotation = raw * lr + rots_bias [1,0,0,0] (unnormalized in the PLY)
        row[13] = rotation[i * 4 + 0] + 1.f;
        row[14] = rotation[i * 4 + 1];
        row[15] = rotation[i * 4 + 2];
        row[16] = rotation[i * 4 + 3];
        fwrite(row.data(), sizeof(float), row.size(), f);
    }
    fclose(f);
    return true;
}

}  // namespace

// ---------------------------------------------------------------------------
// e2e command
// ---------------------------------------------------------------------------

// Every e2e knob is an explicit field: the CLI fills this struct from argv
// flags, and the pipeline reads no process environment at all. This keeps
// the stage contracts discoverable, unit-testable and free of the leaked-
// environment failure mode.

int cmd_e2e(const E2eOptions& opt) {
    const std::string& models_dir = opt.models_dir;
    const std::string& cond_dir = opt.cond_dir;
    const std::string& noise_dir = opt.noise_dir;
    const std::string& dbg_dir = opt.dbg_dir;
    const std::string& out_ply = opt.out_ply;
    const std::string& out_pbr = opt.out_pbr;
    const std::string& out_mesh_vertices = opt.out_mesh_vertices;
    const std::string& out_mesh_faces = opt.out_mesh_faces;
    const std::string& out_pose = opt.out_pose;
    const std::string& out_dtype_contract = opt.out_dtype_contract;
    const char* be_name = opt.backend.c_str();
    const std::string dt = opt.dtype;
    const std::string ss_dt = opt.ss_dtype.empty() ? dt : opt.ss_dtype;
    // The occupancy decoder determines the sparse support consumed by every
    // later stage. Keep it independently selectable so Q4 flow experiments
    // can retain this small, threshold-sensitive model without promoting the
    // multi-gigabyte SS transformer.
    const std::string ss_decoder_dt =
            opt.ss_decoder_dtype.empty() ? ss_dt : opt.ss_decoder_dtype;
    // Keep the structured-latent generator independently selectable for
    // quantization localization. The default preserves the homogeneous E2E
    // model family selected by `dtype`.
    const std::string slat_dt = opt.slat_dtype.empty() ? dt : opt.slat_dtype;
    const std::string gs_dt = opt.gs_dtype.empty() ? dt : opt.gs_dtype;
    const std::string mesh_dt = opt.mesh_dtype.empty() ? dt : opt.mesh_dtype;
    const unsigned seed = opt.seed;
    const int nthreads = opt.threads;
    const auto valid_dtype = [](const std::string& dtype) {
        return dtype == "f32" || dtype == "f16" || dtype == "q4_0" ||
               dtype == "q4_1" || dtype == "q4_k" || dtype == "q8_0";
    };
    if (!valid_dtype(dt) || !valid_dtype(ss_dt) ||
        !valid_dtype(ss_decoder_dt) || !valid_dtype(slat_dt) ||
        !valid_dtype(mesh_dt)) {
        LOGE("e2e: unsupported model dtype: base=%s ss=%s ss_decoder=%s "
             "slat=%s mesh=%s",
             dt.c_str(), ss_dt.c_str(), ss_decoder_dt.c_str(), slat_dt.c_str(),
             mesh_dt.c_str());
        return 1;
    }
    // The decoder graph accepts every model dtype accepted above. CUDA and
    // Vulkan both have native Q4_1 matrix and copy support; rejecting the
    // exported Q4_1 decoder here made the E2E path unreachable.
    if (!valid_dtype(gs_dt)) {
        LOGE("e2e: unsupported Gaussian decoder dtype: %s", gs_dt.c_str());
        return 1;
    }
    DtypeContractMetadata dtype_metadata;
    dtype_metadata.backend = be_name;
    dtype_metadata.base_dtype = dt;
    dtype_metadata.ss_dtype = ss_dt;
    dtype_metadata.ss_decoder_dtype = ss_decoder_dt;
    dtype_metadata.slat_dtype = slat_dt;
    dtype_metadata.gs_dtype = gs_dt;
    dtype_metadata.mesh_dtype = mesh_dt;
    std::string dtype_contract_error;
    ScopedDtypeContractRecording dtype_contract(
            out_dtype_contract, dtype_metadata, dtype_contract_error);
    if (!out_dtype_contract.empty() && !dtype_contract.enabled()) {
        LOGE("e2e: cannot start dtype contract recording: %s",
             dtype_contract_error.c_str());
        return 1;
    }
    if (!out_pbr.empty()) {
#if !defined(SAM3D_USE_NVDIFFRAST_CUDARASTER)
        LOGE("e2e: --pbr-out requires CUDA native PBR with "
             "SAM3D_GGML_NVDIFFRAST_NONCOMMERCIAL=ON");
        return 1;
#elif !defined(SAM3D_USE_MESHFIX_GPL)
        LOGE("e2e: --pbr-out requires SAM3D_GGML_MESHFIX_GPL=ON for the "
             "official "
             "pymeshfix TMesh cleanup; no approximate repair is substituted");
        return 1;
#endif
    }
    if (out_mesh_vertices.empty() != out_mesh_faces.empty()) {
        LOGE("e2e: --mesh-vertices-out and --mesh-faces-out must be provided "
             "together");
        return 1;
    }
    const auto t_start = std::chrono::steady_clock::now();
    const auto elapsed_seconds = [&]() {
        return std::chrono::duration<double>(std::chrono::steady_clock::now() -
                                             t_start)
                .count();
    };
    // Split the pipeline into independent processes when GPU memory is tight:
    //   cond: embedder/fuser -> fused condition tokens
    //   ss:   SS flow/decoder -> sparse coordinates
    //   slat: SLat flow/Gaussian decoder -> PLY
    // This prevents a prior model's CUDA allocator pool from consuming the
    // memory required by the next model's graph. "flow" remains compatible.
    const bool cond_stage = opt.stage == "cond";
    const bool ss_stage = opt.stage == "ss";
    const bool slat_stage = opt.stage == "slat";
    const bool flow_stage_env = opt.stage == "flow";

    // ---------------- stage A: sparse structure --------------------------
    // The SLat process receives coordinates and does not need SS weights.
    Stage ss;
    if (!flow_stage_env && !slat_stage) {
        if (!ss.open(models_dir + "/ss_generator-" + ss_dt + ".gguf", be_name,
                     nthreads, "condition_ss_generator",
                     static_cast<Backend*>(opt.shared_backend))) {
            LOGE("e2e: failed to load ss_generator");
            return 1;
        }
        LOGI("e2e: ss_generator loaded (%s)", ss_dt.c_str());
    }

