Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
        // fuser -> ss condition tokens (1024, 7528)
        // ss_cond filled by the fuser below
        {
            GraphContext gctx;
            std::vector<FuserSeg> segs = {
                    {1024, n_dino, 0, 0, std::move(d_img)},
                    {1024, n_dino, 0, 1, std::move(d_rgb)},
                    {1024, n_dino, 1, 0, std::move(d_mask)},
                    {1024, n_dino, 1, 1, std::move(d_rgbm)},
                    {512, n_pp, 2, 0, std::move(p_pm)},
                    {512, n_pp, 2, 1, std::move(p_rgbpm)},
            };
            ggml_tensor* out = build_fuser(gctx, *ss.model, segs, "cemb");
            ggml_cgraph* graph =
                    ggml_new_graph_custom(gctx.ctx(), 16384, false);
            ggml_build_forward_expand(graph, out);
            record_dtype_contract_graph("ss_condition_fuser", graph);
            if (!ss.backend->alloc(graph)) {
                LOGE("e2e: fuser alloc failed");
                return 1;
            }
            for (auto& s : segs) {
                if (!ss.backend->set_input_f32(s.tokens, s.host.data(),
                                               s.host.size()))
                    return 1;
            }
            if (!ss.backend->run(graph)) {
                LOGE("e2e: fuser run failed");
                return 1;
            }
            ss.backend->get_tensor_f32(out, ss_cond);
        }
    }
    LOGI("e2e: ss condition tokens %lld", (long long)ss_cond.size() / 1024);
    if (!dbg_dir.empty() && !ss_cond.empty())
        save_raw_tensor_f32(dbg_dir + "/e2e_ss_cond_tokens.samt", {1024, 7528},
                            ss_cond.data());

    // fresh backend for the flow graph: a shared gallocr across the embedder
    // graphs and the flow graph changed its allocation layout and produced
    // NaNs on the 4th flow run (CUDA only); a clean gallocr per stage is
    // also the CLI-verified configuration.
    ss.close();

    // A strict replay consumes immutable official support. The dedicated SLat
    // stage likewise starts from coordinates produced by the dedicated SS
    // process, so neither path allocates SS model state in this process.
    const bool strict_reference_coords = opt.reference_coords;
    std::vector<int32_t> coords;  // (N,4) [b, x, y, z], z fastest
    uint32_t distribution_blocks = 0;
#if defined(SAM3D_USE_CUDA)
    std::unique_ptr<PytorchCudaNormalRng> pytorch_cuda_rng;
    // A CUDA-only build resolves `auto` to its registered CUDA device. The
    // verified PyTorch CUDA kernel remains the source implementation there.
    if (std::strcmp(be_name, "cuda") == 0 ||
        std::strcmp(be_name, "auto") == 0) {
        std::string rng_contract_error;
        if (!PytorchCudaNormalRng::distribution_blocks(distribution_blocks,
                                                       rng_contract_error)) {
            LOGE("e2e: %s", rng_contract_error.c_str());
            return 1;
        }
        pytorch_cuda_rng = std::make_unique<PytorchCudaNormalRng>(
                seed, distribution_blocks);
    }
#endif
    std::unique_ptr<PytorchPhiloxNormalRng> pytorch_rng_contract;
#if !defined(SAM3D_USE_CUDA)
    constexpr bool uses_cuda_rng = false;
#else
    const bool uses_cuda_rng = pytorch_cuda_rng != nullptr;
#endif
    if (opt.philox_blocks > 0) {
        distribution_blocks = opt.philox_blocks;
    } else if (!uses_cuda_rng) {
        std::string rng_contract_error;
        if (!pytorch_philox_distribution_blocks_from_environment(
                    distribution_blocks, rng_contract_error)) {
            LOGE("e2e: %s", rng_contract_error.c_str());
            return 1;
        }
    }
    // CUDA materializes normal samples with the verified device kernel, while
    // this parallel state tracks the same counter for the later randperm.
    // CPU/Vulkan also materialize from this state directly.
    pytorch_rng_contract =
            std::make_unique<PytorchPhiloxNormalRng>(seed, distribution_blocks);
    auto fill_sampling_noise = [&](std::vector<float>& values) -> bool {
#if defined(SAM3D_USE_CUDA)
        if (pytorch_cuda_rng) {
            std::string rng_error;
            if (!pytorch_cuda_rng->fill(values, rng_error)) {
                LOGE("e2e: PyTorch-compatible CUDA RNG failed: %s",
                     rng_error.c_str());
                return false;
            }
            if (!pytorch_rng_contract->advance_normal(values.size(),
                                                      rng_error)) {
                LOGE("e2e: cannot advance Philox randperm state: %s",
                     rng_error.c_str());
                return false;
            }
            return true;
        }
#endif
        std::string rng_error;
        if (!pytorch_rng_contract->fill(values, rng_error)) {
            LOGE("e2e: PyTorch-compatible portable Philox RNG failed: %s",
                 rng_error.c_str());
            return false;
        }
        return true;
    };
    if (!slat_stage && (!flow_stage_env || !strict_reference_coords)) {
        // ---- SS sampling: 25 rescaled Euler steps; CFG covers every modality
        // ---- Values match pipeline.yaml plus InferencePipeline's SS defaults.
        // The Python wrapper enables no_shortcut, so d remains zero for every
        // step.
        constexpr int kSsSteps = 25;
        constexpr float kSsRescaleT = 3.0f;
        constexpr float kSsCfgStrength = 7.0f;
        constexpr float kSsCfgStart = 0.0f;
        constexpr float kSsCfgEnd = 500.0f;
        const int64_t n_shape = 4096;
        std::vector<float> x_shape(8 * n_shape), x_6d(6), x_sc(3), x_tr(3),
                x_ts(1);
        const bool replayed_ss_noise =
                load_noise_opt(noise_dir, "ss_x0_shape.samt", x_shape,
                               8 * n_shape) &&
                load_noise_opt(noise_dir, "ss_x0_6drotation_normalized.samt",
                               x_6d, 6) &&
                load_noise_opt(noise_dir, "ss_x0_scale.samt", x_sc, 3) &&
                load_noise_opt(noise_dir, "ss_x0_translation.samt", x_tr, 3) &&
                load_noise_opt(noise_dir, "ss_x0_translation_scale.samt", x_ts,
                               1);
        if (!replayed_ss_noise) {
            if (!noise_dir.empty()) {
                LOGE("e2e: --noise-dir must contain valid F32 SS initial-noise "
                     "tensors");
                return 1;
            }
            LOGI("e2e: reference noise unavailable, using seed %u", seed);
            // `latent_mapping` is an insertion-ordered Python dict.  The
            // official generator draws in this order from one CUDA Philox
            // state.
            if (!fill_sampling_noise(x_6d) || !fill_sampling_noise(x_sc) ||
                !fill_sampling_noise(x_shape) || !fill_sampling_noise(x_tr) ||
                !fill_sampling_noise(x_ts))
                return 1;
        }

        Stage ssf;
        if (!ssf.open(models_dir + "/ss_generator-" + ss_dt + ".gguf", be_name,
                      nthreads, "ss_flow",
                      static_cast<Backend*>(opt.shared_backend))) {
            LOGE("e2e: failed to reload ss_generator for the flow stage");
            return 1;
        }
        GraphContext fg;
        SsFlowGraph sfg;
        sfg.g = &fg;
        sfg.m = ssf.model.get();
        sfg.n_cond_tokens = 7528;
        // The official SS backbone is an F32 model (use_fp16=false): its
        // attention contract is F32 SDPA, so K/V stay in F32 by default.
        sfg.strict_attention = opt.ss_strict_attention;
        // Exact raw-string match like the upstream reference implementation:
        // only an explicit "cuda" request enables the F16 autocast chain, so
        // the default "auto" keeps the SS flow in F32 and bit-exact with the
        // upstream production path (888224 gaussian count parity).
        sfg.f16_autocast = std::strcmp(be_name, "cuda") == 0;
        // SS debug probe: ss_flow_graph's build() short-circuits and returns
        // the debug-stage tensor as the only output when debug_stage is set.
        if (!opt.debug_stage.empty()) sfg.debug_stage = opt.debug_stage;
        auto outs = sfg.build();  // dict order: 6drot, scale, shape,
                                  // translation, ts
        ggml_cgraph* fgraph = ggml_new_graph_custom(fg.ctx(), 32768, false);
        for (auto* o : outs) {
            ggml_set_output(o);
            ggml_build_forward_expand(fgraph, o);
        }
        record_dtype_contract_graph("ss_flow", fgraph);
        if (!ssf.backend->alloc(fgraph)) {
            LOGE("e2e: ss flow alloc failed");
            return 1;
        }
        if (opt.progress) opt.progress(kStageSsFlow, 0, 0);
        LOGI("e2e: ss flow graph built (%d nodes)", ggml_graph_n_nodes(fgraph));

        std::vector<float> zeros_cond(ss_cond.size(), 0.0f);
        // Table values are invariant for all Euler/CFG replays. A Vulkan A/B
        // experiment produced different sparse coordinates when caching this
        // input, so the path remains opt-in until buffer lifetime is proven.
        const bool cache_vulkan_ss_tables =
                strstr(ssf.backend->backend_name(), "Vulkan") != nullptr &&
                opt.vulkan_ss_table_cache && !opt.vulkan_table_cache;
        auto up_scalar = [&](ggml_tensor* t, float v) {
            return !t->buffer || ssf.backend->set_input_f32(t, &v, 1);
        };
        auto upload_ss_tables = [&]() -> bool {
            for (size_t ti = 0; ti < sfg.inputs.size(); ++ti) {
                ggml_tensor* input = sfg.inputs[ti];
                if (!input->buffer || !sfg.table_data[ti]) continue;
                const auto& host = sfg.table_data[ti];
                const bool ok =
                        input->type == GGML_TYPE_F32
                                ? ssf.backend->set_input_f32(
                                          input,
                                          reinterpret_cast<const float*>(
                                                  host->data()),
                                          host->size())
                                : ssf.backend->set_input_i32(
                                          input, host->data(), host->size());
                if (!ok) {
                    LOGE("e2e: failed to upload SS table %s", input->name);
                    return false;
                }
            }
            return true;
        };
        if (cache_vulkan_ss_tables && !upload_ss_tables()) return 1;
        auto upload_and_run = [&](float t_v, bool zero_cond) -> bool {
            auto up = [&](ggml_tensor* t, const std::vector<float>& v) {
                if (!t->buffer) return true;
                return ssf.backend->set_input_f32(t, v.data(), v.size());
            };
            if (!up(sfg.x_shape, x_shape)) return false;
            if (!up(sfg.x_6drot, x_6d)) return false;
            if (!up(sfg.x_scale, x_sc)) return false;
            if (!up(sfg.x_trans, x_tr)) return false;
            if (!up(sfg.x_ts, x_ts)) return false;
            if (!up_scalar(sfg.t, t_v)) return false;
            if (!up_scalar(sfg.d, 0.0f)) return false;
            if (!up(sfg.cond, zero_cond ? zeros_cond : ss_cond)) return false;
            if (!cache_vulkan_ss_tables && !upload_ss_tables()) return false;
            if (opt.verify) {
                float rb_t = -9;
                std::vector<float> rb_t1(1), rb_c(4), rb_x(4);
                ssf.backend->get_tensor_f32(sfg.t, rb_t1);
                rb_t = rb_t1[0];
                ssf.backend->get_tensor_f32(sfg.cond, rb_c);
                ssf.backend->get_tensor_f32(sfg.x_shape, rb_x);
                LOGI("verify: t=%g c0=%g x0=%g (expect t=%g c0=%g x0=%g)", rb_t,
                     rb_c[0], rb_x[0], t_v, (zero_cond ? 0.0f : ss_cond[0]),
                     x_shape[0]);
            }
            return ssf.backend->run(fgraph);
        };
        auto get_outs = [&](std::vector<std::vector<float>>& v) {
            v.resize(outs.size());
            for (size_t i = 0; i < outs.size(); i++)
                ssf.backend->get_tensor_f32(outs[i], v[i]);
        };

        int ss_steps = opt.ss_steps;
        if (ss_steps < 1 || ss_steps > kSsSteps) {
            LOGE("e2e: --ss-steps must be in [1, %d], got %d", kSsSteps,
                 ss_steps);
            return 1;
        }
        const auto ss_schedule = make_euler_schedule(kSsSteps, kSsRescaleT);
        if (!opt.debug_stage.empty() &&
            strcmp(opt.debug_stage.c_str(), "im2col") != 0 &&
            strcmp(opt.debug_stage.c_str(), "gemm") != 0 &&
            strcmp(opt.debug_stage.c_str(), "convout") != 0) {
            // SS debug probe: replay only the first Euler step (the same t the
            // main loop would use) and dump the debug-stage tensor. Used by
            // the sam3d parity ladder to bisect SS DiT internals block by
            // block (b0_adaln -> b0_qkv -> b0_attn_out -> b0_res ...).
            // The decoder boundary names (im2col/gemm/convout) are handled by
            // the SS decoder probe further down.
            if (outs.size() != 1) {
                LOGE("e2e: ss debug stage '%s' did not short-circuit build",
                     opt.debug_stage.c_str());
                return 1;
            }
            const float t_v = ss_schedule[0].t * 1000.0f;
            if (!upload_and_run(t_v, false)) {
                LOGE("e2e: ss debug probe run failed");
                return 1;
            }
            std::vector<float> vals;
            if (!ssf.backend->get_tensor_f32(outs[0], vals)) {
                LOGE("e2e: ss debug probe readback failed");
                return 1;
            }
            const std::string dbg_out =
                    dbg_dir.empty()
                            ? "ss_dbg_" + opt.debug_stage + ".samt"
                            : dbg_dir + "/ss_dbg_" + opt.debug_stage + ".samt";
            save_raw_tensor_f32(
                    dbg_out,
                    std::vector<int64_t>{outs[0]->ne[0], outs[0]->ne[1]},
                    vals.data());
            LOGI("e2e: ss debug stage '%s' dumped (%zu elems) -> %s",
                 opt.debug_stage.c_str(), vals.size(), dbg_out.c_str());
            return 0;
        }
        for (int step = 0; step < ss_steps; ++step) {
            const float t_v = ss_schedule[step].t * 1000.0f;
            if (!upload_and_run(t_v, false)) {
                LOGE("e2e: ss cond run failed");
                return 1;
            }
            std::vector<std::vector<float>> vc;
            get_outs(vc);
            std::vector<std::vector<float>> vu;
            const bool cfg_active = t_v >= kSsCfgStart && t_v <= kSsCfgEnd;
            if (cfg_active) {
                if (!upload_and_run(t_v, true)) {
                    LOGE("e2e: ss uncond run failed");
                    return 1;
                }
                get_outs(vu);
            }
            if (!dbg_dir.empty()) {
                for (size_t oi = 0; oi < outs.size(); oi++) {
                    save_raw_tensor_f32(dbg_dir + "/e2e_ss_vc" +
                                                std::to_string(step) + "_" +
                                                std::to_string(oi) + ".samt",
                                        std::vector<int64_t>{outs[oi]->ne[0],
                                                             outs[oi]->ne[1]},
                                        vc[oi].data());
                    if (cfg_active) {
                        save_raw_tensor_f32(
                                dbg_dir + "/e2e_ss_vu" + std::to_string(step) +
                                        "_" + std::to_string(oi) + ".samt",
                                std::vector<int64_t>{outs[oi]->ne[0],
                                                     outs[oi]->ne[1]},
                                vu[oi].data());
                    }
                }
                // dump the step-1 inputs for offline CLI repro
                if (step == 1) {
                    save_raw_tensor_f32(dbg_dir + "/e2e_ss_x1_shape.samt",
                                        {8, n_shape}, x_shape.data());
                    save_raw_tensor_f32(dbg_dir + "/e2e_ss_x1_6d.samt", {6},
                                        x_6d.data());
                }
            }
            for (size_t i = 0; i < outs.size(); i++) {
                std::vector<float>& x = i == 2   ? x_shape
                                        : i == 0 ? x_6d
                                        : i == 1 ? x_sc
                                        : i == 3 ? x_tr
                                                 : x_ts;
                for (size_t k = 0; k < x.size(); k++) {
                    // ``cfg_modalities`` belongs to the Shortcut training
                    // target; the inference wrapper's scalar
                    // ClassifierFreeGuidance strength is applied to every
                    // output modality.
                    const float velocity =
                            cfg_active ? vc[i][k] + kSsCfgStrength * (vc[i][k] -
                                                                      vu[i][k])
                                       : vc[i][k];
                    x[k] += ss_schedule[step].dt * velocity;
                }
            }
            if (!dbg_dir.empty()) {
                const char* x_names[] = {"6drotation_normalized", "scale",
                                         "shape", "translation",
                                         "translation_scale"};
                const std::vector<float>* states[] = {&x_6d, &x_sc, &x_shape,
                                                      &x_tr, &x_ts};
                // 2-D records match the reference SAMT files (the pose states
                // are single-column tensors, and a 1-D record broke shape
                // equality).
                const std::vector<int64_t> x_ne[] = {
                        {6, 1}, {3, 1}, {8, n_shape}, {3, 1}, {1, 1}};
                for (size_t i = 0; i < 5; i++) {
                    save_raw_tensor_f32(dbg_dir + "/e2e_ss_state" +
                                                std::to_string(step + 1) + "_" +
                                                x_names[i] + ".samt",
                                        x_ne[i], states[i]->data());
                }
            }
            LOGI("e2e: ss step %d/%d done", step + 1, ss_steps);
        }
        LOGI("e2e: ss flow done in %.1fs", elapsed_seconds());
        ssf.close();
        if (!dbg_dir.empty())
            save_raw_tensor_f32(dbg_dir + "/e2e_ss_shape_latent.samt",
                                {8, n_shape}, x_shape.data());
        if (ss_stage && opt.ss_flow_only) {
            LOGI("e2e: SS flow-only diagnostic done in %.1fs",
                 elapsed_seconds());
            return 0;
        }

