Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
        // ---- ss_decoder -> occupancy -> coords ------------------------------
        {
            // the SS decoder lives in its own GGUF (ss_decoder-*.gguf)
            Stage dec;
            if (opt.progress) opt.progress(kStageSsDecode, 0, 0);
            if (!dec.open(models_dir + "/ss_decoder-" + ss_decoder_dt + ".gguf",
                          be_name, nthreads, "ss_decoder",
                          static_cast<Backend*>(opt.shared_backend))) {
                LOGE("e2e: failed to load ss_decoder");
                return 1;
            }
            GraphContext gctx;
            SsDecoderGraph sdg;
            sdg.ctx = gctx.ctx();
            sdg.m = dec.model.get();
            // SS decoder debug probe: short-circuit build() at the requested
            // boundary (im2col/gemm/convout) for parity bisects.
            if (!opt.debug_stage.empty())
                sdg.debug_stage = opt.debug_stage.c_str();
            // torch lat_in =
            // shape_latent(1,4096,8).permute(0,2,1).view(1,8,16,16,16): memory
            // becomes channel-major c*4096 + (x*16+y)*16+z -> transpose here
            std::vector<float> lat_cm(x_shape.size());
            for (int64_t n = 0; n < n_shape; n++)
                for (int c = 0; c < 8; c++)
                    lat_cm[c * n_shape + n] = x_shape[n * 8 + c];
            ggml_tensor* lat = gctx.input_f32("latent", {16, 16, 16, 8});
            ggml_tensor* occ = sdg.build(lat);
            ggml_cgraph* graph = ggml_new_graph_custom(gctx.ctx(), 8192, false);
            ggml_build_forward_expand(graph, lat);
            ggml_build_forward_expand(graph, occ);
            record_dtype_contract_graph("ss_decoder", graph);
            if (!dec.backend->alloc(graph)) {
                LOGE("e2e: ss decoder alloc failed");
                return 1;
            }
            if (!dec.backend->set_input_f32(lat, lat_cm.data(), lat_cm.size()))
                return 1;
            if (!dec.backend->run(graph)) {
                LOGE("e2e: ss decoder run failed");
                return 1;
            }
            std::vector<float> occ_f;
            dec.backend->get_tensor_f32(occ, occ_f);
            dec.close();
            if (!opt.debug_stage.empty()) {
                // Debug build returned the boundary tensor; dump it and stop
                // before the occupancy expansion that expects (64,64,64).
                const std::string dbg_out2 =
                        dbg_dir.empty()
                                ? "ss_dbg_dec_" + opt.debug_stage + ".samt"
                                : dbg_dir + "/ss_dbg_dec_" + opt.debug_stage +
                                          ".samt";
                save_raw_tensor_f32(
                        dbg_out2,
                        {occ->ne[0], occ->ne[1], occ->ne[2], occ->ne[3]},
                        occ_f.data());
                LOGI("e2e: ss decoder debug stage '%s' dumped (%zu elems) -> "
                     "%s",
                     opt.debug_stage.c_str(), occ_f.size(), dbg_out2.c_str());
                return 0;
            }
            LOGI("e2e: ss decoder done in %.1fs", elapsed_seconds());
            // torch (1,1,64,64,64) C-order: flat = (x*64 + y)*64 + z
            for (int x = 0; x < 64; x++)
                for (int y = 0; y < 64; y++)
                    for (int z = 0; z < 64; z++)
                        if (occ_f[((x * 64) + y) * 64 + z] > 0.0f)
                            coords.insert(coords.end(), {0, x, y, z});
        }
        // Pre-compute the effective downsample factor before the pose decode:
        // the official pipeline rescales the decoded instance scale by
        // downsample_factor whenever the pruned sparse support exceeds
        // max_coords (inference_pipeline.py "Rescaling scale by <factor> after
        // downsampling"). prune_surface_coords is deterministic, so re-running
        // it here on the same pre-prune coords yields the same decision the
        // SLat-stage branch below will make; the factor must be known here
        // because the pose decode runs before that branch in this function.
        int effective_pose_downsample_factor = 1;
        if (!(slat_stage && !strict_reference_coords)) {
            const std::vector<int32_t> pruned = prune_surface_coords(coords);
            if (static_cast<int64_t>(pruned.size() / 4) > 42000) {
                effective_pose_downsample_factor = 2;
            }
        }
        const bool want_pose_json = !out_pose.empty();
        const bool want_pose_artifact =
                opt.artifacts != nullptr && opt.scene_attributes;
        if (want_pose_json || want_pose_artifact) {
            std::array<float, 3> pointmap_scale{};
            std::array<float, 3> pointmap_shift{};
            if (opt.conditions) {
                pointmap_scale = opt.conditions->pointmap_scale;
                pointmap_shift = opt.conditions->pointmap_shift;
            } else if (!load_f32_vector(
                               cond_dir + "/ss_input_pointmap_scale.samt", 3,
                               pointmap_scale) ||
                       !load_f32_vector(
                               cond_dir + "/ss_input_pointmap_shift.samt", 3,
                               pointmap_shift)) {
                return 1;
            }
            NativeInstancePose pose;
            std::string pose_error;
            if (!decode_scale_shift_invariant_pose(
                        x_6d.data(), x_sc.data(), x_tr.data(), x_ts[0],
                        pointmap_scale.data(), pointmap_shift.data(), pose,
                        pose_error, effective_pose_downsample_factor)) {
                LOGE("e2e: native pose decode/export failed: %s",
                     pose_error.c_str());
                return 1;
            }
            if (want_pose_json &&
                !write_native_pose_json(out_pose, pose, pose_error)) {
                LOGE("e2e: native pose decode/export failed: %s",
                     pose_error.c_str());
                return 1;
            }
            if (want_pose_artifact) {
                opt.artifacts->pose = pose;
                opt.artifacts->has_pose = true;
            }
            LOGI("e2e: decoded official ScaleShiftInvariant pose");
        }
        LOGI("e2e: occupancy coords %lld (of 262144)",
             (long long)coords.size() / 4);
        ss.close();  // free the SS weights before the SLat stage
    }

    int64_t n_coord = 0;
    if (slat_stage && !strict_reference_coords) {
        const char* coords_path_env = opt.coords_path.c_str();
        if (!coords_path_env) {
            LOGE("e2e: SAM3D_E2E_COORDS_PATH is required for the slat stage");
            return 1;
        }
        RawTensor saved_coords;
        if (!load_raw_tensor(coords_path_env, saved_coords) ||
            saved_coords.type != GGML_TYPE_I32 || saved_coords.ne.size() != 2 ||
            saved_coords.ne[0] != 4 ||
            saved_coords.data.size() % (4 * sizeof(int32_t)) != 0) {
            LOGE("e2e: invalid sparse coordinate SAMT: %s", coords_path_env);
            return 1;
        }
        const int32_t* values =
                reinterpret_cast<const int32_t*>(saved_coords.data.data());
        coords.assign(values,
                      values + saved_coords.data.size() / sizeof(int32_t));
        n_coord = static_cast<int64_t>(coords.size() / 4);
        LOGI("e2e: loaded %lld sparse coords from the SS stage",
             static_cast<long long>(n_coord));
    } else {
        const size_t before_prune = coords.size() / 4;
        coords = prune_surface_coords(coords);
        LOGI("e2e: surface-pruned sparse coords %zu -> %zu", before_prune,
             coords.size() / 4);
        n_coord = static_cast<int64_t>(coords.size() / 4);
        if (n_coord > 42000) {
            const size_t before = coords.size() / 4;
            bool randomly_subsampled = false;
            std::string downsample_error;
            coords = downsample_sparse_coords_pytorch(
                    coords, *pytorch_rng_contract, downsample_error,
                    randomly_subsampled, 42000, 2);
            if (coords.empty()) {
                LOGE("e2e: PyTorch-compatible coordinate randperm failed: %s",
                     downsample_error.c_str());
                return 1;
            }
            n_coord = static_cast<int64_t>(coords.size() / 4);
            LOGI("e2e: downsampled sparse coords %zu -> %zu with PyTorch "
                 "Philox randperm%s",
                 before, coords.size() / 4,
                 randomly_subsampled ? "" : " (dedup only)");
        }
    }
    // A strict replay holds the sparse support fixed to the official output.
    // It isolates SLat and Gaussian-decoder quantization from a boundary flip
    // in SS occupancy; normal image-to-3D inference never sets this switch.
    if (strict_reference_coords) {
        RawTensor reference_coords;
        if (!load_raw_tensor(cond_dir + "/coords.samt", reference_coords) ||
            reference_coords.type != GGML_TYPE_I32 ||
            reference_coords.data.size() % (4 * sizeof(int32_t)) != 0) {
            LOGE("e2e: invalid reference coords.samt");
            return 1;
        }
        const int32_t* values =
                reinterpret_cast<const int32_t*>(reference_coords.data.data());
        coords.assign(values,
                      values + reference_coords.data.size() / sizeof(int32_t));
        n_coord = static_cast<int64_t>(coords.size() / 4);
        LOGI("e2e: strict replay replaces sparse support with %lld official "
             "coords",
             static_cast<long long>(n_coord));
    }
    if (ss_stage) {
        RawTensor saved_coords;
        saved_coords.ne = {4, n_coord};
        saved_coords.type = GGML_TYPE_I32;
        saved_coords.data.resize(coords.size() * sizeof(int32_t));
        std::memcpy(saved_coords.data.data(), coords.data(),
                    saved_coords.data.size());
        const std::string coords_path = out_ply + ".coords.samt";
        if (!save_raw_tensor(coords_path, saved_coords)) {
            LOGE("e2e: failed to save SS coordinates: %s", coords_path.c_str());
            return 1;
        }
        LOGI("e2e-ss: wrote %lld sparse coords to %s",
             static_cast<long long>(n_coord), coords_path.c_str());
        return 0;
    }

    // ---------------- stage B: structured latent -------------------------
    if (!skip_cond) {
        Stage slat_emb;
        if (!slat_emb.open(models_dir + "/slat_generator-" + slat_dt + ".gguf",
                           be_name, nthreads, "slat_condition_generator",
                           static_cast<Backend*>(opt.shared_backend))) {
            LOGE("e2e: failed to load slat_generator");
            return 1;
        }
        LOGI("e2e: slat_generator loaded (%s)", slat_dt.c_str());

        // slat DINOs (prenorm mode: 1374 tokens each, registers kept) run on a
        // dedicated stage (fresh gallocr); the flow stage is opened after.
        int64_t n_sdino = 0;
        auto sd = run_dino_batch(slat_emb,
                                 {{"cemb.emb0", &ci.image},
                                  {"cemb.emb0", &ci.rgb_image},
                                  {"cemb.emb1", &ci.mask3},
                                  {"cemb.emb1", &ci.rgb_image_mask3}},
                                 true, n_sdino, nullptr,
                                 opt.cond_manual_attention);
        if (sd.empty() || sd[0].empty()) {
            LOGE("e2e: slat dino failed");
            return 1;
        }
        std::vector<float> s_dimg = std::move(sd[0]), s_drgb = std::move(sd[1]);
        std::vector<float> s_dmask = std::move(sd[2]),
                           s_drgbm = std::move(sd[3]);
        LOGI("e2e: slat dino tokens done (n=%lld each)", (long long)n_sdino);

        // slat_cond loaded (embedder or flow dump)
        {
            GraphContext gctx;
            std::vector<FuserSeg> segs = {
                    {1024, n_sdino, 0, 0, std::move(s_dimg)},
                    {1024, n_sdino, 0, 1, std::move(s_drgb)},
                    {1024, n_sdino, 1, 0, std::move(s_dmask)},
                    {1024, n_sdino, 1, 1, std::move(s_drgbm)},
            };
            ggml_tensor* out = build_fuser(gctx, *slat_emb.model, segs, "cemb");
            ggml_cgraph* graph =
                    ggml_new_graph_custom(gctx.ctx(), 16384, false);
            ggml_build_forward_expand(graph, out);
            record_dtype_contract_graph("slat_condition_fuser", graph);
            if (!slat_emb.backend->alloc(graph)) {
                LOGE("e2e: slat fuser alloc failed");
                return 1;
            }
            for (auto& s : segs) {
                if (!slat_emb.backend->set_input_f32(s.tokens, s.host.data(),
                                                     s.host.size()))
                    return 1;
            }
            if (!slat_emb.backend->run(graph)) {
                LOGE("e2e: slat fuser run failed");
                return 1;
            }
            slat_emb.backend->get_tensor_f32(out, slat_cond);
        }
        slat_emb.close();
    }

    // fresh stage for the slat flow loop (CLI-verified single-graph gallocr)
    Stage slat;
    if (!slat.open(models_dir + "/slat_generator-" + slat_dt + ".gguf", be_name,
                   nthreads, "slat_flow",
                   static_cast<Backend*>(opt.shared_backend))) {
        LOGE("e2e: failed to reload slat_generator");
        return 1;
    }
    const int64_t n_slat_cond = (int64_t)slat_cond.size() / 1024;
    LOGI("e2e: slat condition tokens %lld (%.1fs)", (long long)n_slat_cond,
         elapsed_seconds());
    if (!dbg_dir.empty())
        save_raw_tensor_f32(dbg_dir + "/e2e_slat_cond_tokens.samt",
                            {1024, n_slat_cond}, slat_cond.data());

    // sparse tables from the (fixed) coords
    SlatTables tb;
    if (!tb.build(coords.data(), n_coord)) {
        LOGE("e2e: slat tables failed");
        return 1;
    }
    LOGI("e2e: sparse tables nf=%lld nc=%lld", (long long)tb.nf,
         (long long)tb.nc);

    // ---- SLat sampling: Euler steps with the pipeline CFG schedule ----
    // pipeline.yaml overrides the SLat configuration to strength=1 and
    // rescale_t=1; override_slat_generator_cfg_config supplies [0, 500].
    // The deployment pipeline distills the trajectory to 12 steps while the
    // repository trajectory gate fixes 25; the count is opt-driven.
    constexpr int kSlatGateSteps = 25;
    if (opt.slat_steps < 1 || opt.slat_steps > kSlatGateSteps) {
        LOGE("e2e: slat steps must be in [1, %d], got %d", kSlatGateSteps,
             opt.slat_steps);
        return 1;
    }
    const int kSlatSteps = opt.slat_steps;
    constexpr float kSlatRescaleT = 1.0f;
    constexpr float kSlatCfgStrength = 1.0f;
    constexpr float kSlatCfgStart = 0.0f;
    constexpr float kSlatCfgEnd = 500.0f;
    std::vector<float> x_slat(8 * tb.nf);
    const bool replayed_slat_noise =
            load_slat_noise_for_coords(noise_dir, coords, seed, x_slat);
    if (!replayed_slat_noise) {
        if (!noise_dir.empty()) {
            LOGE("e2e: --noise-dir must contain valid SLat initial noise and "
                 "coordinates");
            return 1;
        }
        if (!fill_sampling_noise(x_slat)) return 1;
    }

    GraphContext sg;
    SlatFlowGraph slg;
    slg.g = &sg;
    slg.m = slat.model.get();
    slg.tb = &tb;
    slg.n_cond_tokens = n_slat_cond;
    slg.use_cuda_spconv = be_is_cuda(be_name);
    const bool split_slat_final =
            ggml_is_quantized(slat.model->get("dit.out_layer.weight")->type) &&
            slat.backend->has_gpu() && opt.debug_stage.empty();
    // Quantized final projections need a split graph to avoid changing the
    // trunk's allocation layout.  Keep an independent allocator for that
    // small final graph so both graphs stay allocated across all Euler/CFG
    // evaluations instead of reallocating them 100 times per sample.
    std::unique_ptr<Backend> slat_final_backend;
    if (split_slat_final) {
        slat_final_backend = Backend::create(be_name, nthreads);
        if (!slat_final_backend) {
            LOGE("e2e: failed to create SLat final-projection backend");
            return 1;
        }
        slat_final_backend->set_profile_label("slat_final_projection");
    }
    if (split_slat_final) {
        slg.debug_stage = "pre_final";
    } else if (const char* debug_stage = opt.debug_stage.c_str()) {
        slg.debug_stage = debug_stage;
    }
    auto s_outs = slg.build();
    // Matches the independently validated slat-step graph. The graph has
    // about 2.3k nodes, so 32k leaves ample headroom without changing the
    // context allocation layout between CLI and end-to-end execution.
    ggml_cgraph* s_graph = ggml_new_graph_custom(sg.ctx(), 32768, false);
    for (auto* o : s_outs) {
        ggml_set_output(o);
        ggml_build_forward_expand(s_graph, o);
    }
    record_dtype_contract_graph("slat_flow", s_graph);
    if (!slat.backend->alloc(s_graph)) {
        LOGE("e2e: slat flow alloc failed");
        return 1;
    }
    if (opt.progress) opt.progress(kStageSlatFlow, 0, 0);
    LOGI("e2e: slat flow graph built (%d nodes)", ggml_graph_n_nodes(s_graph));

