Asher-1/ACloudViewer/core/AICore/src/tasks/sam3d/session.cpp
private:
    std::string path_;
    bool remove_on_exit_ = false;
};

bool merge_binary_mask_into_alpha(RgbaImage& image,
                                  const std::string& mask_path,
                                  std::string& error) {
    if (mask_path.empty()) return true;
    RgbaImage mask;
    if (!load_rgba_image(mask_path, mask, error)) return false;
    if (mask.width != image.width || mask.height != image.height) {
        error = "mask dimensions must match the input image";
        return false;
    }
    for (size_t pixel = 0;
         pixel < static_cast<size_t>(image.width) * image.height; ++pixel) {
        // notebook/inference.py::load_mask applies `mask > 0` and selects the
        // last decoded channel. Preserve that binary alpha contract exactly.
        image.rgba[pixel * 4 + 3] = mask.rgba[pixel * 4 + 3] == 0 ? 0 : 255;
    }
    return true;
}

}  // namespace

// Shared validation used by both the session init and the one-shot wrapper.
namespace {

bool validate_session_config(const ImageTo3DOptions& opts, std::string& error) {
    if (opts.models_dir.empty() || opts.moge_model.empty()) {
        error = "models_dir and moge_model are required";
        return false;
    }
    if (opts.dtype.empty()) {
        error = "dtype is required";
        return false;
    }
    const auto valid_dtype = [](const std::string& dtype) {
        return dtype == "f32" || dtype == "f16" || dtype == "q4_0" ||
               dtype == "q4_1" || dtype == "q4_k" || dtype == "q8_0";
    };
    if (!valid_dtype(opts.dtype)) {
        error = "unsupported dtype '" + opts.dtype + "'";
        return false;
    }
    if (opts.n_threads <= 0) {
        error = "n_threads must be positive";
        return false;
    }
    return true;
}

}  // namespace

struct ImageTo3DSession::Impl {
    ImageTo3DOptions config;
    std::unique_ptr<Backend> backend;
    // The MoGe weights are loaded lazily per request and released right after
    // the forward: keeping 600 MB resident next to the generative stages
    // overflows a 12 GiB card, and mmap makes the reload nearly free while a
    // cache hit skips it entirely.
    std::unique_ptr<GGUFModel> moge_model;

    // Process-shared physical backend handles (runtime registry leases).
    std::vector<aicore::runtime::BackendLease> leases() const {
        return backend ? backend->leases()
                       : std::vector<aicore::runtime::BackendLease>();
    }

    // RGB-only MoGe reuse: the point map depends on the RGB channels and the
    // inference options only, never on the mask alpha, so a request whose RGB
    // bytes match the previous request skips the MoGe forward entirely. The
    // mask merge and condition preprocessing still run every request.
    std::vector<uint8_t> cached_rgb;
    int cached_width = 0;
    int cached_height = 0;
    bool cached_valid = false;
    MogeInferenceResult cached_moge;

    bool init(const ImageTo3DOptions& config_in, std::string& error) {
        if (!validate_session_config(config_in, error)) return false;
        config = config_in;
        backend = Backend::create(config.backend.c_str(), config.n_threads);
        if (!backend) {
            error = "failed to create the requested MoGe backend";
            return false;
        }
        return true;
    }

    RunResult run(const ImageTo3DOptions& opts) {
        RunResult result;
        if (!opts.image_override && opts.image_path.empty()) {
            result.error = "image_path is required";
            return result;
        }
        if (opts.out_ply.empty() && opts.artifacts == nullptr) {
            // The pipeline needs at least one output: the file export or the
            // in-memory artifact sink (the C API path).
            result.error = "out_ply or artifacts is required";
            return result;
        }
        if (opts.progress) opts.progress(0 /*load*/, 0, 0);
        if (!validate_session_config(opts, result.error)) return result;
        // The session fixes models/backend/dtype/threads; a mismatching
        // request would silently change numerics or reuse foreign weights.
        if (opts.models_dir != config.models_dir ||
            opts.moge_model != config.moge_model ||
            opts.backend != config.backend || opts.dtype != config.dtype ||
            opts.n_threads != config.n_threads) {
            result.error =
                    "request settings must match the session configuration "
                    "(models_dir, moge_model, backend, dtype, n_threads)";
            return result;
        }
        if (opts.out_mesh_vertices.empty() != opts.out_mesh_faces.empty()) {
            result.error =
                    "out_mesh_vertices and out_mesh_faces must be provided "
                    "together";
            return result;
        }
        if (!opts.noise_dir.empty()) {
            std::error_code filesystem_error;
            if (!std::filesystem::is_directory(opts.noise_dir,
                                               filesystem_error) ||
                filesystem_error) {
                result.error =
                        "noise_dir must be a readable official stage directory";
                return result;
            }
        }

        RgbaImage image;
        std::string error;
        if (opts.image_override) {
            image.width = opts.image_override->width;
            image.height = opts.image_override->height;
            image.rgba = opts.image_override->rgba;
            if (image.width <= 0 || image.height <= 0 ||
                image.rgba.size() !=
                        static_cast<size_t>(image.width) * image.height * 4) {
                result.error = "invalid in-memory RGBA input";
                return result;
            }
        } else if (!load_rgba_image(opts.image_path, image, error) ||
                   !merge_binary_mask_into_alpha(image, opts.mask_path,
                                                 error)) {
            result.error = error;
            return result;
        }

        // RGB fingerprint of the mask-merged image; only the first three
        // channels participate because MoGe never sees alpha.
        const size_t pixels = static_cast<size_t>(image.width) * image.height;
        std::vector<uint8_t> rgb(pixels * 3);
        for (size_t p = 0; p < pixels; ++p) {
            rgb[p * 3 + 0] = image.rgba[p * 4 + 0];
            rgb[p * 3 + 1] = image.rgba[p * 4 + 1];
            rgb[p * 3 + 2] = image.rgba[p * 4 + 2];
        }
        const bool cache_hit = !opts.disable_moge_pointmap_cache &&
                               cached_valid && cached_width == image.width &&
                               cached_height == image.height &&
                               cached_rgb == rgb;

        MogeInferenceResult moge_result;
        if (cache_hit) {
            // The cached result is immutable and the condition preprocessing
            // below only reads it, so sharing across requests is safe.
            moge_result = cached_moge;
            result.output.stats.moge_pointmap_reused = true;
            LOGI("image-to-3d: reusing the cached MoGe point map for identical "
                 "RGB");
        } else {
            if (opts.progress) opts.progress(1 /*pointmap*/, 0, 0);
            const auto moge_started = std::chrono::steady_clock::now();
            // A request-scoped MoGe backend keeps the CUDA pool from
            // accumulating cross-request fragmentation: per-object token
            // counts vary, the pool never returns chunks, and late objects in
            // a batch would OOM on the pointpatch reserve. The mmap-backed
            // weight reload is cheap and the pool dies with the backend.
            auto moge_backend =
                    Backend::create(config.backend.c_str(), config.n_threads);
            if (!moge_backend) {
                result.error = "failed to create the MoGe backend";
                return result;
            }
            // The request-scoped MoGe backend owns its own registry leases
            // (invisible to the caller-held session lock); hold them for the
            // whole forward+teardown so shared GPU handles stay serialized.
            aicore::runtime::BackendLeaseLock moge_lease_lock =
                    aicore::runtime::lock_backend_leases(
                            moge_backend->leases());
            moge_model = std::make_unique<GGUFModel>();
            if (!moge_model->load(config.moge_model,
                                  moge_backend->weights_buffer_type())) {
                result.error = "failed to load MoGe GGUF: " + config.moge_model;
                return result;
            }
            MogeInferenceOptions moge_options;
            // The official pipeline feeds the condition chain the FULL finite
            // point map (its raw receipt has zero NaN/Inf; the predicted-mask
            // inf fill is never seen downstream). Keeping apply_mask on would
            // inject Inf that the bilinear upsample turns into NaN and that
            // resize_pointmap_to_image then re-spreads, which is what diverged
            // the seven small-object SS trajectories.
            moge_options.apply_mask = false;
            if (!run_moge_inference(image, *moge_model, *moge_backend,
                                    moge_options, moge_result, error)) {
                result.error = "native MoGe inference failed: " + error;
                return result;
            }
            // Release the MoGe weights AND its backend before the generative
            // stages allocate; the mmap-backed reload on the next cache miss
            // is cheap and the freed pool removes the fragmentation source.
            moge_model.reset();
            moge_backend.reset();
            LOGI("image-to-3d: moge done in %.1fs",
                 std::chrono::duration<double>(
                         std::chrono::steady_clock::now() - moge_started)
                         .count());
            cached_rgb = std::move(rgb);
            cached_width = image.width;
            cached_height = image.height;
            cached_moge = moge_result;
            cached_valid = true;
        }

        NativeConditionInputs condition_inputs;
        if (!preprocess_ss_conditions(image, moge_result.pointmap_pytorch3d,
                                      moge_result.width, moge_result.height, {},
                                      condition_inputs, error)) {
            result.error = "native condition preprocessing failed: " + error;
            return result;
        }
        // The conditions_out path is a caller-requested condition dump (a
        // replay/inspection artifact): create the directory and write the
        // SAMT files as before. The default C API path hands the condition
        // tensors to cmd_e2e in memory — no scratch directory and no
        // condition file IO in the end-to-end request.
        bool cond_memory_path = false;
        std::string cond_dir_for_e2e;
        if (opts.conditions_out.empty()) {
            cond_memory_path = true;
        } else {
            ScopedConditionDirectory conditions;
            if (!conditions.create(opts.conditions_out, error)) {
                result.error = error;
                return result;
            }
            if (!write_ss_conditions(conditions.path(), condition_inputs,
                                     error)) {
                result.error =
                        "native condition preprocessing failed: " + error;
                return result;
            }
            cond_dir_for_e2e = conditions.path();
        }

        E2eOptions e2e;
        e2e.models_dir = opts.models_dir;
        e2e.cond_dir = cond_dir_for_e2e;
        // image-to-3d generates noise internally (empty noise_dir = fresh
        // noise)
        e2e.out_ply = opts.out_ply;
        e2e.out_pbr = opts.out_pbr;
        e2e.out_mesh_vertices = opts.out_mesh_vertices;
        e2e.out_mesh_faces = opts.out_mesh_faces;
        e2e.out_pose = opts.out_pose;
        e2e.out_dtype_contract = opts.out_dtype_contract;
        e2e.backend = opts.backend.empty() ? "auto" : opts.backend;
        e2e.threads = opts.n_threads;
        e2e.seed = static_cast<unsigned>(opts.seed);
        e2e.dtype = opts.dtype;
        // The image-to-3D production path uses strict F32 condition attention
        // (the flash K/V path measurably perturbs the DINO outlier channels)
        // and the official F32 SS attention contract.
        e2e.cond_manual_attention = true;
        e2e.ss_strict_attention = opts.strict_ss_attention;
        e2e.gs_portable_attention = opts.gs_portable_attention;
        e2e.philox_blocks = opts.philox_blocks;
        e2e.ss_steps = opts.ss_steps;
        e2e.slat_steps = opts.slat_steps;
        // Accuracy-diagnostic fixed noise (upstream official stage dir);
        // empty = generate from seed as the production path does.
        e2e.noise_dir = opts.noise_dir;
        // Share the backend across stages only where its allocator survives a
        // stream of differently-shaped graphs. Vulkan's sub-allocator reuses
        // freed ranges; CUDA's pool never returns chunks to the driver, so a
        // batch whose per-object token counts vary fragments the pool and the
        // late objects OOM. On CUDA each stage keeps its own backend (the
        // per-object layout already verified 27/27) while the session still
        // removes the process launch and the repeated MoGe load. The CUDA
        // family is decided from the RESOLVED backend name so an "auto"
        // request that lands on CUDA takes the same per-stage layout as an
        // explicit "cuda" request.
        e2e.shared_backend = (backend && strncasecmp(backend->backend_name(),
                                                     "cuda", 4) == 0)
                                     ? nullptr
                                     : backend.get();
        e2e.artifacts = opts.artifacts;
        e2e.decode_mesh = opts.decode_mesh;
        e2e.scene_attributes = opts.scene_attributes;
        e2e.conditions = cond_memory_path ? &condition_inputs : nullptr;
        e2e.progress = opts.progress;
        const int rc = cmd_e2e(e2e);

        result.ok = rc == 0;
        if (!result.ok) {
            result.error = "native image-to-3D session failed; see log output";
        }
        return result;
    }
};

ImageTo3DSession::ImageTo3DSession() : impl_(std::make_unique<Impl>()) {}
ImageTo3DSession::~ImageTo3DSession() = default;

std::vector<aicore::runtime::BackendLease> ImageTo3DSession::leases() const {
    return impl_->leases();
}

std::string ImageTo3DSession::backend_name() const {
    return impl_->backend ? impl_->backend->backend_name()
                          : std::string("none");
}

bool ImageTo3DSession::init(const ImageTo3DOptions& config,
                            std::string& error) {
    return impl_->init(config, error);
}

RunResult ImageTo3DSession::run(const ImageTo3DOptions& opts) {
    return impl_->run(opts);
}

RunResult run_image_to_3d(const ImageTo3DOptions& opts) {
    // One-shot wrapper: identical numerics to the session path because it is
    // the session path with a throwaway session object.
    ImageTo3DSession session;
    std::string error;
    if (!session.init(opts, error)) {
        RunResult result;
        result.error = error;
        return result;
    }
    return session.run(opts);
}

}  // namespace sam3d
